src/PAIP2clojure/Porting PAIP to clojure chapter 2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Porting PAIP to clojure chapter 2 </title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Porting PAIP to clojure chapter 2 "/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-29T19:06+0200"/>
<meta name="author" content="Maik Schünemann"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Porting PAIP to clojure chapter 2 </h1>


<hr/>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Porting PAIP to clojure - chapter 2 A Simple Lisp Program or use the best notation available to solve you problem</a>
<ul>
<li><a href="#sec-1-1">1.1 Introduction</a></li>
<li><a href="#sec-1-2">1.2 Generating random Sentences</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 The Grammar</a></li>
<li><a href="#sec-1-2-2">1.2.2 The Program</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 A data-driven solution</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 The representation of the grammar</a></li>
<li><a href="#sec-1-3-2">1.3.2 Evaluating the grammar</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 Advantages of the data-driven solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Porting PAIP to clojure - chapter 2 A Simple Lisp Program or use the best notation available to solve you problem</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">

<p>   This is the first post of my series porting PAIP to clojure.
   It is possible to follow my post even if you don't PAIP but I strongly recommend that you get a copy
   of it.
   This chapter contains a program to generate random sentences using a grammar for a subset of english.
   Norvig presents two versions of the program, a straightforward solution using functions to generate random 
   sentences from a grammar
   Then the weaknesses of this approach are shown and a better solution is developed using a data-driven solution.
   Afterwards, the advantages of the data-driven approach are discussed.
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Generating random Sentences</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> The Grammar</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>     Sentence =&gt; Noun-Phrase + Verb-Phrase
     Noun-Phrase =&gt; Article + Noun
     &hellip;
     Article =&gt; the, a, &hellip;.
     &hellip;
     A rule consists either of two or more non-terminals like Noun-phrase or of a collection of
     terminals like the, a,&hellip;
     This representation is very natural if you have ever worked with context-free grammars before.
     The rule Article =&gt; the, a, &hellip;  means: An article is either the or a or &hellip; (Article = the | a | &hellip;)
</p>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> The Program</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>    That is the Common Lisp code for the naive solution. It can be found <a href="http://norvig.com/paip/README.html">here</a>.
</p>


<pre class="src src-common">(defun sentence ()    (append (noun-phrase) (verb-phrase)))
(defun noun-phrase () (append (Article) (Noun)))
(defun verb-phrase () (append (Verb) (noun-phrase)))
(defun Article ()     (one-of '(the a)))
(defun Noun ()        (one-of '(man ball woman table)))
(defun Verb ()        (one-of '(hit took saw liked)))
</pre>

<p>
    The translation to clojure is straightforward. But I will use a slightly modified version which is, as I think,
    a little bot more ideomatic in clojure:
</p>


<pre class="src src-clojure">(<span style="color: #eedd82;">declare</span> sentence noun-phrase verb-phrase article noun verb one-of)

(<span style="color: #00ffff;">defn</span>  <span style="color: #87cefa;">sentence</span> [] (<span style="color: #eedd82;">concat</span> (noun-phrase) (verb-phrase)))
(<span style="color: #00ffff;">defn</span>  <span style="color: #87cefa;">noun-phrase</span> [] (<span style="color: #eedd82;">concat</span> (article) (noun)))
(<span style="color: #00ffff;">defn</span>  <span style="color: #87cefa;">verb-phrase</span> [] (<span style="color: #eedd82;">concat</span> (verb) (noun-phrase)))
(<span style="color: #00ffff;">defn</span>  <span style="color: #87cefa;">article</span> [] (one-of [<span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"a"</span>]))
(<span style="color: #00ffff;">defn</span>  <span style="color: #87cefa;">noun</span> [] (one-of [<span style="color: #ffa07a;">"man"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"woman"</span> <span style="color: #ffa07a;">"table"</span>]))
(<span style="color: #00ffff;">defn</span>  <span style="color: #87cefa;">verb</span> [] (one-of [<span style="color: #ffa07a;">"hit"</span> <span style="color: #ffa07a;">"took"</span> <span style="color: #ffa07a;">"saw"</span> <span style="color: #ffa07a;">"liked"</span>]))
</pre>


<pre class="example">
=&gt; #'user/verb
</pre>


<p>
    I use vectors instead of lists and strings instead of symbols. here are the helper-functions:
    one-of picks one element of the collection and returns a single-element collection containing it.
</p>


<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">one-of</span> [coll]
  (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">seq</span> coll)
   [(rand-nth coll)]))
</pre>


<p>
    To test, let's get 10 random sentences:
</p>
    

<pre class="src src-clojure">(<span style="color: #eedd82;">take</span> 10 (<span style="color: #eedd82;">repeatedly</span> sentence))   
</pre>


<p>
    this evaluates to:
</p>


<pre class="src src-clojure">((<span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"liked"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"ball"</span>)
(<span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"table"</span> <span style="color: #ffa07a;">"took"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"ball"</span>)
(<span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"man"</span> <span style="color: #ffa07a;">"took"</span> <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"man"</span>)
(<span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"woman"</span> <span style="color: #ffa07a;">"saw"</span> <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"man"</span>)
(<span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"hit"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"ball"</span>)
(<span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"table"</span> <span style="color: #ffa07a;">"hit"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"man"</span>)
(<span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"took"</span> <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"ball"</span>)
(<span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"man"</span> <span style="color: #ffa07a;">"liked"</span> <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"ball"</span>)
(<span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"table"</span> <span style="color: #ffa07a;">"saw"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"ball"</span>)
(<span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"woman"</span> <span style="color: #ffa07a;">"hit"</span> <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"ball"</span>))
</pre>

<p>
    I believe it is apparent that this is not a good representation for a grammar. The lisp functions are definitly
    harder to read than the normal grammar syntax shown above.
    As an example, if you wanted to represent the following rule:
    Adj* =&gt; e,Adj + Adj*
    (note that e is the empty symbol)
    you would have to write a function like this:
</p>


<pre class="src src-clojure">(<span style="color: #eedd82;">declare</span> <span style="color: #b0c4de;">Adj</span>)
(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">Adj*</span> []
  (<span style="color: #b0c4de;">if</span> (<span style="color: #eedd82;">=</span> (<span style="color: #eedd82;">rand-int</span> 2) 0)
    nil
    (<span style="color: #eedd82;">concat</span> (<span style="color: #b0c4de;">Adj</span>) (Adj*))))
</pre>

<p>
==&gt; #'user/Adj*
</p>
<p>
    There has to be a better way&hellip; enter the data-driven solution!
</p></div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> A data-driven solution</h3>
<div class="outline-text-3" id="text-1-3">

<p>   The naive solution is straightforward to implement while making it harder to encode the grammar rules.
   By using a data-driven approach, it is the other war round. Writing grammar rules becomes easy
   while implementation may become harder. 
   So let's take a look how the data-driven solution works for this problem.
</p>
</div>
