Porting PAIP to clojure chapter 2.org
*** The representation of the grammar
    The first step is to decouple the grammar from the code which processes it.
    In the book Norvig represents the grammar with the following datastructure:
    #+begin_src common lisp
    (defparameter *simple-grammar*
    '((sentence -> (noun-phrase verb-phrase))
     (noun-phrase -> (Article Noun))
     (verb-phrase -> (Verb noun-phrase))
     (Article -> the a)
     (Noun -> man ball woman table)
      (Verb -> hit took saw liked))
   "A grammar for a trivial subset of English.")
    #+end_src
    Here the grammar rule sentence => noun-phrase + verb_phrase gets translated to
    (sentence -> (noun-phrase verb-phrase)).
    So a list of elements means "produce this nonterminals in sequence". Multiple nonterminals
    right of the -> sign mean  "choose one of this nonterminals". 
    Every rule is itself a list and the grammar is a list of rules.

    But this representation is not really clojureish?.
    We can take advantage of clojures literal representation for maps,vectors and sets in addition to lists.
    Using these, the meaning of a datastructure- when choosen appropriate- becomes clearer.
    Let me give you an example:
    What are grammar rules? Rules map a nonterminal to - posible multiple - nonterminals or terminals.
    Thus it is appropriate to represent them as a map in clojure.
    I choose to represent the nonterminals as keywords and the values of the map as
    either one element or a vector of multiple elements.
    A vector means: "apply all elements in order".

    Norvig represents a choice of nonterminals as simply the nonterminals written after the -> sign.
    For me, it was not clear at the beginning that that means "choose one of these nonterminals".
    Using a set in clojure, this becomes obvious.
    Rewritten, the grammar becomes the following:
    #+begin_src clojure
    (def simple-grammar
    {:sentence [:noun-phrase :verb-phrase]
     :noun-phrase [:Article :Noun]
     :verb-phrase [:Verb :noun-phrase]
     :Article #{"the" "a"}
     :Noun #{"man" "ball" "woman" "table"}
     :Verb #{"hit" "took" "saw" "liked"}})

    (def ^:dynamic *grammar* simple-grammar)
    #+end_src
    Ok that's for the design part.
    Now that we have a good representation of our data, the grammar, we have to worry about evaluating it.
