src/PAIP2clojure/Porting PAIP to clojure chapter 2.html

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> The representation of the grammar</h4>
<div class="outline-text-4" id="text-1-3-1">

<p>    The first step is to decouple the grammar from the code which processes it.
    In the book Norvig represents the grammar with the following datastructure:
</p>


<pre class="src src-common"> (defparameter *simple-grammar*
 '((sentence -&gt; (noun-phrase verb-phrase))
  (noun-phrase -&gt; (Article Noun))
  (verb-phrase -&gt; (Verb noun-phrase))
  (Article -&gt; the a)
  (Noun -&gt; man ball woman table)
   (Verb -&gt; hit took saw liked))
<span style="color: #ffa07a;">"A grammar for a trivial subset of English."</span>)
</pre>

<p>
    Here the grammar rule sentence =&gt; noun-phrase + verb<sub>phrase</sub> gets translated to
    (sentence -&gt; (noun-phrase verb-phrase)).
    So a list of elements means "produce this nonterminals in sequence". Multiple nonterminals
    right of the -&gt; sign mean  "choose one of this nonterminals". 
    Every rule is itself a list and the grammar is a list of rules.
</p>
<p>
    But this representation is not really clojureish?.
    We can take advantage of clojures literal representation for maps,vectors and sets in addition to lists.
    Using these, the meaning of a datastructure- when choosen appropriate- becomes clearer.
    Let me give you an example:
    What are grammar rules? Rules map a nonterminal to - posible multiple - nonterminals or terminals.
    Thus it is appropriate to represent them as a map in clojure.
    I choose to represent the nonterminals as keywords and the values of the map as
    either one element or a vector of multiple elements.
    A vector means: "apply all elements in order".
</p>
<p>
    Norvig represents a choice of nonterminals as simply the nonterminals written after the -&gt; sign.
    For me, it was not clear at the beginning that that means "choose one of these nonterminals".
    Using a set in clojure, this becomes obvious.
    Rewritten, the grammar becomes the following:
</p>


<pre class="src src-clojure">(<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">simple-grammar</span>
{<span style="color: #7fffd4;">:sentence</span> [<span style="color: #7fffd4;">:noun-phrase</span> <span style="color: #7fffd4;">:verb-phrase</span>]
 <span style="color: #7fffd4;">:noun-phrase</span> [<span style="color: #7fffd4;">:Article</span> <span style="color: #7fffd4;">:Noun</span>]
 <span style="color: #7fffd4;">:verb-phrase</span> [<span style="color: #7fffd4;">:Verb</span> <span style="color: #7fffd4;">:noun-phrase</span>]
 <span style="color: #7fffd4;">:Article</span> #{<span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"a"</span>}
 <span style="color: #7fffd4;">:Noun</span> #{<span style="color: #ffa07a;">"man"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"woman"</span> <span style="color: #ffa07a;">"table"</span>}
 <span style="color: #7fffd4;">:Verb</span> #{<span style="color: #ffa07a;">"hit"</span> <span style="color: #ffa07a;">"took"</span> <span style="color: #ffa07a;">"saw"</span> <span style="color: #ffa07a;">"liked"</span>}})

(<span style="color: #00ffff;">def</span> <span style="color: #7fffd4;">^:dynamic</span> <span style="color: #87cefa;">*grammar*</span> simple-grammar)
</pre>


<p>
    Ok that's for the design part.
    Now that we have a good representation of our data, the grammar, we have to worry about evaluating it.
</p></div>

</div>
