Porting PAIP to clojure chapter 2.org
*** Evaluating the grammar
    Because I have chosen a different and more ideomatic representation of the grammar in clojure, the code for
    evaluating the grammar will be different than the code in PAIP. So don't expect a literal translation of the
    PAIP code.
     
    So, how can we generate a possible sentence: 
    the function 'generate' will take the startsymbol as argument and retrieves the rule from the grammar.
    If there is not a rule for the argument in the grammar, the argument itself is evaluated (thus making it
    possible to call generate either with the left hand or the right hand side of a rule).
    It will recurse on the elements of the rule in sequence, appending the result as it goes along.
    When it encounters a set, it will generate one random element of it.
    it recursively generates the nonterminal. If it encounters a terminal, that is none of the above are true,
    it just returns a single-element vector of it.
    #+begin_src clojure
    (defn generate [phrase]
        (cond (get *grammar* phrase) (generate (get *grammar* phrase))
              (sequential? phrase) (mapcat generate phrase)
              (set? phrase)  (generate (rand-nth (seq phrase)))
              :else [phrase]))
    #+end_src
    Amazing how closely the code mimics the description.
    So this is data-dricen programming. Decouple the representation of the data from the code which evaluates it.

    Let's take a look at a more complicated example and see how the
    data-driven approach scales. Here's the bigger grammar:
    #+begin_src clojure
    (def bigger-grammar
     {:sentence [:noun-phrase :verb-phrase]
      :noun-phrase #{[:Article :Adj* :Noun :PP*] :Name :Pronoun}
      :verb-phrase [:Verb :noun-phrase :PP*]
      :PP* #{[] [:PP :PP*]}
      :Adj* #{[] [:Adj :Adj*]}
      :PP [:Prep :noun-phrase]
      :Prep #{"to" "in" "by" "with" "on"}
      :Adj #{"big" "little" "blue" "green" "adiabatic"}
      :Article #{"the" "a"}
      :Name #{"Pat" "Kim" "Lee" "Terry" "Robin"}
      :Noun #{"man" "ball" "woman" "table"}
      :Verb #{"hit" "took" "saw" "liked"}
      :Pronoun #{"he" "she" "it" "these" "those" "that"}
     })
    (def ^:dynamic *grammar* bigger-grammar)
    #+end_src
    Let's generate 10 sentences again:
    #+begin_src clojure
    (take 10 (repeatedly #(generate :sentence)))
    
    (("these" "liked" "a" "ball")
     ("a" "ball" "in" "the" "big" "green" "big" "woman" "in" "that" "by" "Terry" "liked" "a" "man")
     ("that" "liked" "that")
     ("Lee" "hit" "it")
     ("Lee" "took" "Lee")
     ("the" "little" "blue" "little" "ball" "in" "Terry" "by" "Robin" "liked" "Pat")
     ("a" "adiabatic" "blue" "blue" "ball" "saw" "the" "man" "in" "Pat" "by" "Lee" "on" "a" "adiabatic" "table"
      "in" "Terry")
     ("Pat" "hit" "Robin" "to" "those")
     ("those" "liked" "the" "woman" "with" "Robin" "with" "these" "in" "the" "table" "to" "Robin" "to" "a"
      "blue" "adiabatic" "ball" "with" "she" "on" "those" "on" "those")
     ("it" "hit" "Kim" "on" "she" "on" "the" "table"))
    #+end_src
    It works! Enjoy the funny sentences.
    But hey, what if we wanted to see how the sentences are generated, to see the parse-tree.
    Because of the data-driven design, it is easy to implement this. The data doesn't need to be changed, we need
    only a new evaluation-function. 
    #+begin_src clojure
    (defn generate-all [phrase]
        (cond (get *grammar* phrase)  (list phrase (generate-all (get *grammar* phrase)))
              (sequential? phrase) (mapcat generate-all phrase)
              (set? phrase)  (generate-all (rand-nth (seq phrase)))
              :else phrase))
    #+end_src
    there are only two changes: make a list of phrase and the generated symbols before recursing and return the
    phrase in the base call instead of a single item vector containing it.
    Imaging changing all functions to achieve this instead of just two lines ...
    #+begin_src clojure
    (generate-all :sentence)
    ;=>
        (:sentence 
          (:noun-phrase 
             (:Name "Kim")
           :verb-phrase 
             (:Verb "saw"
              :noun-phrase 
                (:Article "the"
                 :Adj* 
                   (:Adj "adiabatic" 
                    :Adj* ())
                 :Noun "ball" 
                 :PP* ())
              :PP* ())))
    #+end_src
    
   Norvig gives a last example of a generate-all function, which works on the simple grammar and returns all
   possible sentences defined by the grammar (the language of the grammar).
   I leaf the implementation to the reader :)
   
