src/PAIP2clojure/Porting PAIP to clojure chapter 2.html

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Evaluating the grammar</h4>
<div class="outline-text-4" id="text-1-3-2">

<p>    Because I have chosen a different and more ideomatic representation of the grammar in clojure, the code for
    evaluating the grammar will be different than the code in PAIP. So don't expect a literal translation of the
    PAIP code.
</p>
<p>     
    So, how can we generate a possible sentence: 
    the function 'generate' will take the startsymbol as argument and retrieves the rule from the grammar.
    If there is not a rule for the argument in the grammar, the argument itself is evaluated (thus making it
    possible to call generate either with the left hand or the right hand side of a rule).
    It will recurse on the elements of the rule in sequence, appending the result as it goes along.
    When it encounters a set, it will generate one random element of it.
    it recursively generates the nonterminal. If it encounters a terminal, that is none of the above are true,
    it just returns a single-element vector of it.
</p>


<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">generate</span> [phrase]
    (<span style="color: #b0c4de;">cond</span> (<span style="color: #eedd82;">get</span> *grammar* phrase) (generate (<span style="color: #eedd82;">get</span> *grammar* phrase))
          (<span style="color: #eedd82;">sequential?</span> phrase) (<span style="color: #eedd82;">mapcat</span> generate phrase)
          (<span style="color: #eedd82;">set?</span> phrase)  (generate (rand-nth (<span style="color: #eedd82;">seq</span> phrase)))
          <span style="color: #7fffd4;">:else</span> [phrase]))
</pre>

<p>
    Amazing how closely the code mimics the description.
    So this is data-dricen programming. Decouple the representation of the data from the code which evaluates it.
</p>
<p>
    Let's take a look at a more complicated example and see how the
    data-driven approach scales. Here's the bigger grammar:
</p>


<pre class="src src-clojure">(<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">bigger-grammar</span>
 {<span style="color: #7fffd4;">:sentence</span> [<span style="color: #7fffd4;">:noun-phrase</span> <span style="color: #7fffd4;">:verb-phrase</span>]
  <span style="color: #7fffd4;">:noun-phrase</span> #{[<span style="color: #7fffd4;">:Article</span> <span style="color: #7fffd4;">:Adj*</span> <span style="color: #7fffd4;">:Noun</span> <span style="color: #7fffd4;">:PP*</span>] <span style="color: #7fffd4;">:Name</span> <span style="color: #7fffd4;">:Pronoun</span>}
  <span style="color: #7fffd4;">:verb-phrase</span> [<span style="color: #7fffd4;">:Verb</span> <span style="color: #7fffd4;">:noun-phrase</span> <span style="color: #7fffd4;">:PP*</span>]
  <span style="color: #7fffd4;">:PP*</span> #{[] [<span style="color: #7fffd4;">:PP</span> <span style="color: #7fffd4;">:PP*</span>]}
  <span style="color: #7fffd4;">:Adj*</span> #{[] [<span style="color: #7fffd4;">:Adj</span> <span style="color: #7fffd4;">:Adj*</span>]}
  <span style="color: #7fffd4;">:PP</span> [<span style="color: #7fffd4;">:Prep</span> <span style="color: #7fffd4;">:noun-phrase</span>]
  <span style="color: #7fffd4;">:Prep</span> #{<span style="color: #ffa07a;">"to"</span> <span style="color: #ffa07a;">"in"</span> <span style="color: #ffa07a;">"by"</span> <span style="color: #ffa07a;">"with"</span> <span style="color: #ffa07a;">"on"</span>}
  <span style="color: #7fffd4;">:Adj</span> #{<span style="color: #ffa07a;">"big"</span> <span style="color: #ffa07a;">"little"</span> <span style="color: #ffa07a;">"blue"</span> <span style="color: #ffa07a;">"green"</span> <span style="color: #ffa07a;">"adiabatic"</span>}
  <span style="color: #7fffd4;">:Article</span> #{<span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"a"</span>}
  <span style="color: #7fffd4;">:Name</span> #{<span style="color: #ffa07a;">"Pat"</span> <span style="color: #ffa07a;">"Kim"</span> <span style="color: #ffa07a;">"Lee"</span> <span style="color: #ffa07a;">"Terry"</span> <span style="color: #ffa07a;">"Robin"</span>}
  <span style="color: #7fffd4;">:Noun</span> #{<span style="color: #ffa07a;">"man"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"woman"</span> <span style="color: #ffa07a;">"table"</span>}
  <span style="color: #7fffd4;">:Verb</span> #{<span style="color: #ffa07a;">"hit"</span> <span style="color: #ffa07a;">"took"</span> <span style="color: #ffa07a;">"saw"</span> <span style="color: #ffa07a;">"liked"</span>}
  <span style="color: #7fffd4;">:Pronoun</span> #{<span style="color: #ffa07a;">"he"</span> <span style="color: #ffa07a;">"she"</span> <span style="color: #ffa07a;">"it"</span> <span style="color: #ffa07a;">"these"</span> <span style="color: #ffa07a;">"those"</span> <span style="color: #ffa07a;">"that"</span>}
 })
(<span style="color: #00ffff;">def</span> <span style="color: #7fffd4;">^:dynamic</span> <span style="color: #87cefa;">*grammar*</span> bigger-grammar)
</pre>


<p>
    Let's generate 10 sentences again:
</p>


<pre class="src src-clojure">(<span style="color: #eedd82;">take</span> 10 (<span style="color: #eedd82;">repeatedly</span> #(generate <span style="color: #7fffd4;">:sentence</span>)))

((<span style="color: #ffa07a;">"these"</span> <span style="color: #ffa07a;">"liked"</span> <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"ball"</span>)
 (<span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"in"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"big"</span> <span style="color: #ffa07a;">"green"</span> <span style="color: #ffa07a;">"big"</span> <span style="color: #ffa07a;">"woman"</span> <span style="color: #ffa07a;">"in"</span> <span style="color: #ffa07a;">"that"</span> <span style="color: #ffa07a;">"by"</span> <span style="color: #ffa07a;">"Terry"</span> <span style="color: #ffa07a;">"liked"</span> <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"man"</span>)
 (<span style="color: #ffa07a;">"that"</span> <span style="color: #ffa07a;">"liked"</span> <span style="color: #ffa07a;">"that"</span>)
 (<span style="color: #ffa07a;">"Lee"</span> <span style="color: #ffa07a;">"hit"</span> <span style="color: #ffa07a;">"it"</span>)
 (<span style="color: #ffa07a;">"Lee"</span> <span style="color: #ffa07a;">"took"</span> <span style="color: #ffa07a;">"Lee"</span>)
 (<span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"little"</span> <span style="color: #ffa07a;">"blue"</span> <span style="color: #ffa07a;">"little"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"in"</span> <span style="color: #ffa07a;">"Terry"</span> <span style="color: #ffa07a;">"by"</span> <span style="color: #ffa07a;">"Robin"</span> <span style="color: #ffa07a;">"liked"</span> <span style="color: #ffa07a;">"Pat"</span>)
 (<span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"adiabatic"</span> <span style="color: #ffa07a;">"blue"</span> <span style="color: #ffa07a;">"blue"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"saw"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"man"</span> <span style="color: #ffa07a;">"in"</span> <span style="color: #ffa07a;">"Pat"</span> <span style="color: #ffa07a;">"by"</span> <span style="color: #ffa07a;">"Lee"</span> <span style="color: #ffa07a;">"on"</span> <span style="color: #ffa07a;">"a"</span> <span style="color: #ffa07a;">"adiabatic"</span> <span style="color: #ffa07a;">"table"</span>
  <span style="color: #ffa07a;">"in"</span> <span style="color: #ffa07a;">"Terry"</span>)
 (<span style="color: #ffa07a;">"Pat"</span> <span style="color: #ffa07a;">"hit"</span> <span style="color: #ffa07a;">"Robin"</span> <span style="color: #ffa07a;">"to"</span> <span style="color: #ffa07a;">"those"</span>)
 (<span style="color: #ffa07a;">"those"</span> <span style="color: #ffa07a;">"liked"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"woman"</span> <span style="color: #ffa07a;">"with"</span> <span style="color: #ffa07a;">"Robin"</span> <span style="color: #ffa07a;">"with"</span> <span style="color: #ffa07a;">"these"</span> <span style="color: #ffa07a;">"in"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"table"</span> <span style="color: #ffa07a;">"to"</span> <span style="color: #ffa07a;">"Robin"</span> <span style="color: #ffa07a;">"to"</span> <span style="color: #ffa07a;">"a"</span>
  <span style="color: #ffa07a;">"blue"</span> <span style="color: #ffa07a;">"adiabatic"</span> <span style="color: #ffa07a;">"ball"</span> <span style="color: #ffa07a;">"with"</span> <span style="color: #ffa07a;">"she"</span> <span style="color: #ffa07a;">"on"</span> <span style="color: #ffa07a;">"those"</span> <span style="color: #ffa07a;">"on"</span> <span style="color: #ffa07a;">"those"</span>)
 (<span style="color: #ffa07a;">"it"</span> <span style="color: #ffa07a;">"hit"</span> <span style="color: #ffa07a;">"Kim"</span> <span style="color: #ffa07a;">"on"</span> <span style="color: #ffa07a;">"she"</span> <span style="color: #ffa07a;">"on"</span> <span style="color: #ffa07a;">"the"</span> <span style="color: #ffa07a;">"table"</span>))
</pre>

<p>
    It works! Enjoy the funny sentences.
    But hey, what if we wanted to see how the sentences are generated, to see the parse-tree.
    Because of the data-driven design, it is easy to implement this. The data doesn't need to be changed, we need
    only a new evaluation-function. 
</p>


<pre class="src src-clojure">(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">generate-all</span> [phrase]
    (<span style="color: #b0c4de;">cond</span> (<span style="color: #eedd82;">get</span> *grammar* phrase)  (<span style="color: #eedd82;">list</span> phrase (generate-all (<span style="color: #eedd82;">get</span> *grammar* phrase)))
          (<span style="color: #eedd82;">sequential?</span> phrase) (<span style="color: #eedd82;">mapcat</span> generate-all phrase)
          (<span style="color: #eedd82;">set?</span> phrase)  (generate-all (rand-nth (<span style="color: #eedd82;">seq</span> phrase)))
          <span style="color: #7fffd4;">:else</span> phrase))
</pre>


<pre class="example">
=&gt; #'user/generate-all
</pre>


<p>
    there are only two changes: make a list of phrase and the generated symbols before recursing and return the
    phrase in the base call instead of a single item vector containing it.
    Imaging changing all functions to achieve this instead of just two lines &hellip;
</p>


<pre class="src src-clojure">(generate-all <span style="color: #7fffd4;">:sentence</span>)
<span style="color: #ff7f24;">;</span><span style="color: #ff7f24;">=&gt;</span>
    (<span style="color: #7fffd4;">:sentence</span> 
      (<span style="color: #7fffd4;">:noun-phrase</span> 
         (<span style="color: #7fffd4;">:Name</span> <span style="color: #ffa07a;">"Kim"</span>)
       <span style="color: #7fffd4;">:verb-phrase</span> 
         (<span style="color: #7fffd4;">:Verb</span> <span style="color: #ffa07a;">"saw"</span>
          <span style="color: #7fffd4;">:noun-phrase</span> 
            (<span style="color: #7fffd4;">:Article</span> <span style="color: #ffa07a;">"the"</span>
             <span style="color: #7fffd4;">:Adj*</span> 
               (<span style="color: #7fffd4;">:Adj</span> <span style="color: #ffa07a;">"adiabatic"</span> 
                <span style="color: #7fffd4;">:Adj*</span> ())
             <span style="color: #7fffd4;">:Noun</span> <span style="color: #ffa07a;">"ball"</span> 
             <span style="color: #7fffd4;">:PP*</span> ())
          <span style="color: #7fffd4;">:PP*</span> ())))
</pre>


<p>    
   Norvig gives a last example of a generate-all function, which works on the simple grammar and returns all
   possible sentences defined by the grammar (the language of the grammar).
   I leaf the implementation to the reader :)
</p>
</div>
</div>

</div>
